package chap5;

public record PojoRecord(String id, String name, String dateOfBirth, String classList) {
//    POJO는 많은 보일러 플레이트 코드를 가지고 있다.
//    자주 쓰이지만 한번 생성하고 나면 거의 바뀌지 않는다.
//    이런 경우 레코드를 사용하면 편리하다.
//    레코드는 클래스와 비슷하지만 불변이며, 기본적인 메서드와 생성자 등을 자동으로 생성해준다.

//    레코드 헤더: 레코드의 이름과 레코드의 필드를 나열하는 부분
//    레코드의 필드명과 똑같이 매개변수 이름을 지정해야 한다.
//    레코드의 필드는 private final로 선언된다.
//    레코드의 프로퍼티를 사용할 때는 get 접두어를 붙이지 않는다. ex) getId() -> id()

//    레코드가 불변인 이유
//    불변의 DTO를 사용하면 스레드 안전성을 보장할 수 있다.
//    캡슐화를 통해 데이터를 보호할 수 있다.
//    Setter가 없기 때문에 데이터를 변경할 수 없다.
}
